/*
 * @Author: lizhigang
 * @Date: 2023-02-09 16:02:57
 * @Company: orientsec.com.cn
 * @Description: 歌曲播放链接与歌词mock
 */
import { rest } from 'msw'

export const getSongsUrl = rest.get('/api/getSongsUrl', (req, res, ctx) => {
  return res(
    ctx.status(200),
    ctx.json({
      code: 0,
      result: {
        map: {
          '0019MXW93H5C9u': 'http://isure.stream.qqmusic.qq.com/C400000jXRBi1wcEXE.m4a?guid=9984788180&vkey=736F6B8EB3353D09A1A55B0E704C51EACE86DBF8B3673E7A20243378BB1E4560898C75FD3D1536E05062F8900DAC7A21F4DA990A40475120&uin=&fromtag=123032',
          '001tCE0T2vR5p5': 'http://isure.stream.qqmusic.qq.com/C400000eaMed3yYvDf.m4a?guid=9984788180&vkey=5A6A73388D227D2D79B4A3E8606914B24586F353EE83C0A6034671FDBB42347E302590934015FEF10ECBED9A5F194A98397838A1EB86401D&uin=&fromtag=123032',
          '003SAFY70Nu60A': 'http://isure.stream.qqmusic.qq.com/C400000yWKVe0gATaJ.m4a?guid=4739259567&vkey=900D118D7405CEB60D82E1D058C29E5B01FDA9705AD762187ECF916B09268AFBC05A92543A125AB57BA0132C8FF69FFD70CE1092DDC8E26F&uin=&fromtag=123032',
          '003a2vuS32utR4': 'http://isure.stream.qqmusic.qq.com/C400003a2vuS32utR4.m4a?guid=4739259567&vkey=0DD53D4CB0AF1B6DAD8BD58C0B6EF6C620792B2EC720F41E740AE494DE7E9445BBD955F8412BD058BC4EB95F7FCA0BBDD9F3C1CE3F651506&uin=&fromtag=123982'
        }
      }
    })
  )
})

export const getLyric = rest.get('/api/getLyric', (req, res, ctx) => {
  return res(
    ctx.status(200),
    ctx.json({
      code: 0,
      result: { lyric: '[ti:兰亭序 (慢四版)]\n[ar:周杰伦]\n[al:]\n[by:]\n[offset:0]\n[00:00.00]兰亭序 (慢四版) - 周杰伦 (Jay Chou)\n[00:09.46]词：方文山\n[00:18.92]曲：周杰伦\n[00:28.39]兰亭临帖\n[00:30.07]行书如行云流水\n[00:34.61]月下门推\n[00:36.47]心细如你脚步碎\n[00:40.81]忙不迭\n[00:42.72]千年碑易拓却难拓你的美\n[00:48.22]真迹绝 真心能给谁\n[00:53.55]牧笛横吹\n[00:55.36]黄酒小菜又几碟\n[00:59.72]夕阳余晖\n[01:01.78]如你的羞怯似醉\n[01:06.16]摹本易写\n[01:07.94]而墨香不退与你共留余味\n[01:13.66]一行朱砂 到底圈了谁\n[01:18.88]无关风月 我题序等你回\n[01:25.13]悬笔一绝 那岸边浪千叠\n[01:31.44]情字何解 怎落笔都不对\n[01:37.88]而我独缺 你一生的了解\n[01:45.98]无关风月 我题序等你回\n[01:48.88]悬笔一绝 那岸边浪千叠\n[01:52.17]情字何解 怎落笔都不对\n[01:55.33]而我独缺 你一生的了解\n[01:58.50]无关风月 我题序等你回\n[02:01.78]悬笔一绝 那岸边浪千叠\n[02:05.03]情字何解 怎落笔都不对\n[02:08.08]独缺 你一生了解\n[02:09.54]弹指岁月 倾城顷刻间湮灭\n[02:16.10]月下门推 心细如你脚步碎\n[02:22.75]忙不迭 千年碑易拓\n[02:26.42]却难拓你的美\n[02:29.88]真迹绝 真心能给谁\n[02:35.15]牧笛横吹 黄酒小菜又几碟\n[02:41.73]夕阳余晖 如你的羞怯似醉\n[02:47.91]摹本易写\n[02:49.94]而墨香不退与你同留余味\n[02:55.38]一行朱砂 到底圈了谁\n[03:00.68]无关风月 我题序等你回\n[03:06.91]悬笔一绝 那岸边浪千叠\n[03:13.23]情字何解 怎落笔都不对\n[03:19.74]而我独缺 你一生的了解\n[03:27.92]无关风月 我题序等你回\n[03:30.58]悬笔一绝 那岸边浪千叠\n[03:33.86]情字何解 怎落笔都不对\n[03:37.03]而我独缺 你一生的了解\n[03:40.19]无关风月 我题序等你回\n[03:43.29]悬笔一绝 那岸边浪千叠\n[03:46.52]情字何解 怎落笔都不对\n[03:49.78]独缺 你一生了解\n[03:51.37]弹指岁月 倾城顷刻间湮灭\n[03:57.73]月下门推 心细如你脚步碎\n[04:04.16]忙不迭 千年碑易拓\n[04:08.05]却难拓你的美\n[04:11.55]真迹绝 真心能给谁\n[04:16.88]牧笛横吹 黄酒小菜又几碟\n[04:23.17]夕阳余晖 如你的羞怯似醉\n[04:29.64]摹本易写\n[04:31.63]而墨香不退与你同留余味\n[04:37.17]一行朱砂 到底圈了谁\n[04:42.32]无关风月 我题序等你回\n[04:48.45]悬笔一绝 那岸边浪千叠\n[04:54.82]情字何解 怎落笔都不对\n[05:01.13]而我独缺 你一生的了解\n[05:09.50]无关风月 我题序等你回\n[05:12.27]悬笔一绝 那岸边浪千叠\n[05:15.53]情字何解 怎落笔都不对\n[05:18.72]而我独缺 你一生的了解\n[05:21.92]无关风月 我题序等你回\n[05:24.93]悬笔一绝 那岸边浪千叠\n[05:28.24]情字何解 怎落笔都不对\n[05:31.43]独缺 你一生了解\n[05:33.16]弹指岁月 倾城顷刻间湮灭\n[05:39.11]青石板街 回眸一笑你婉约\n[05:45.78]恨了没\n[05:47.46]你摇头轻叹谁让你蹙着眉\n[05:53.47]而深闺 徒留胭脂味\n[05:58.55]人雁南飞 转身一瞥你噙泪\n[06:04.81]掬一把月 手揽回忆怎么睡\n[06:11.18]又怎么会\n[06:13.10]心事密缝绣花鞋针针怨怼\n[06:18.64]若花怨蝶 你会怨着谁\n[06:24.12]无关风月 我题序等你回\n[06:30.16]悬笔一绝 那岸边浪千叠\n[06:36.58]情字何解 怎落笔都不对\n[06:42.85]而我独缺 你一生的了解\n[06:49.35]无关风月 我题序等你回\n[06:57.14]手书无愧 无惧人间是非\n[07:03.51]雨打蕉叶 又潇潇了几夜\n[07:09.91]我等春雷 来提醒你爱谁' }
    })
  )
})
